{
  "title": "VŠE Studio – Centrum nápovědy",
  "intro": "Tento průvodce vysvětluje, jak pracovat s chatem, projekty a automatizacemi v novém workspace rozhraní.",
  "sections": [
    {
      "title": "Začínáme",
      "items": [
        "Po registraci nebo přihlášení se otevře pracovní plocha se třemi hlavními moduly: Chat, Projekty a Automatizace.",
        "V levém postranním panelu najdete přepínač modulů a rychlý přehled stavu vašeho workspace.",
        "V horní části každého modulu je dostupná kontextová nápověda s klávesovými zkratkami a odkazy na dokumentaci."
      ]
    },
    {
      "title": "Chat",
      "items": [
        "Vlákna konverzací jsou organizována v postranním panelu, kde můžete vytvářet nové chaty, označit je jako oblíbené a filtrovat.",
        "Při odeslání zprávy se ihned uloží do historie. Odpovědi asistenta a změny ve vláknech dorazí v reálném čase pomocí streamu událostí.",
        "Historii můžete exportovat nebo hromadně smazat. Nastavení \"Enter odešle\" a zvolený motiv se ukládají do vašeho profilu."
      ]
    },
    {
      "title": "Projekty",
      "items": [
        "Projekty slouží jako složky pro skupiny chatů a automatizací. Každý projekt má barvu, popis a stav.",
        "Tlačítkem \"Nový projekt\" přidáte další modul – například sběr dat, analytiku nebo plánovač úloh.",
        "Z karty projektu vidíte přehled automatizací a posledních běhů. Projekt lze kdykoliv archivovat."
      ]
    },
    {
      "title": "Automatizace",
      "items": [
        "Automatizace se vážou ke konkrétnímu projektu. Nastavte trigger (např. \"nová zpráva ve vlákně\") a stav aktivní/neaktivní.",
        "Konfiguraci automatizace vyplníte ve formátu JSON – například cílový webhook, časovač nebo vstupní proměnné.",
        "Každý běh se zapisuje do protokolu, odkud je možné zobrazit vstupy i výstupy pro audit."
      ]
    },
    {
      "title": "Bezpečnost a účty",
      "items": [
        "Všechna API volání jsou chráněna pomocí krátkodobých access tokenů a obnovitelných refresh tokenů.",
        "Účet můžete kdykoliv odhlásit. Při podezřelé aktivitě se staré refresh tokeny automaticky zneplatní.",
        "V části \"Nastavení\" (připravujeme) bude možné aktivovat dvoufázové ověření a řídit týmová oprávnění."
      ]
    }
  ]
}
